app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    if(!params[:ratings].nil? and params[:ratings] != session[:ratings])
      @ratings = params[:ratings]
      session[:ratings] = params[:ratings]
    else
      @ratings = session[:ratings]
    end

    if(!params[:sort_by].nil? and params[:sort_by] != session[:ratings])
      @sort_by = params[:sort_by]
      session[:sort_by] = params[:sort_by]
    else
      @sort_by = session[:sort_by]
    end


    if (@sort_by.nil? and @ratings.nil?)
      @movies = Movie.all
    elsif (@ratings.nil?)

      begin
        @movies = Movie.order("#{@sort_by} ASC").all
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date ASC